# 1. คำนวณผลรวมของเบอร์โทรทั้งหมดและดูความหมายตามหลักเลขศาสตร์ ให้ได้เลขผลรวมดีมากหรือดี เช่น 36, 41, 45, 50, 51, 54, 55, 56, 59, 63 และอื่นๆ
#    2. ควรใช้เลขถูกโฉลกให้มากที่สุด เช่น เกิดวันพฤหัส ควรให้มี 8 6 1 2 3 4   และ สามารถดูข้อมูลเพิ่มเติมได้ (เลื่อนลงด้านล่าง)
#  เลขผลรวม สำหรับเบอร์โทรศัพท์
#      # เลขผลรวมดีมาก ได้แก่ 9, 14, 15, 19, 23, 24, 32, 36, 40, 41, 42, 44, 45, 46, 50, 51, 54, 55, 56, 59, 63, 64, 65  ให้คุณระดับดีมาก
#                                            69, 79 โอกาสประสบผลสำเร็จสูง อุปสรรคน้อย เจริญรุ่งเรือง ร่ำรวย รวดเร็ว และมีความสุข
#      # เลขผลรวมดีปานกลาง ได้แก่ 10, 13, 16, 18, 20, 22, 25, 26, 28, 31, 35, 38, 39, 47, 49, 52, 53, 57, 58, 60, 61  ให้คุณระดับดีปานกลาง
#                                            62, 66, 68, 74, 75 เหนื่อย มีอุปสรรค แต่ยังมีโอกาสประสบผลสำเร็จ หากมีความพยายาม
#      # เลขผลรวมไม่ดี ได้แก่ 11, 12, 17, 21, 27, 29, 30, 33, 34, 37, 43, 48, 67, 70, 71, 72, 73, 76, 77, 78, 80 (ให้โทษ ใครได้ผลรวมเหล่านี้ควรเปลี่ยน)
#                                            เหนื่อยมาก อุปสรรคมาก เจอปัญหารุมเร้า การงาน การเงิน ความรัก เกิดอุบัติเหตุชีวิตไม่จบไม่สิ้น

#functions
def berdee(phone_number):
    total = 0
    for n in phone_number:
        total += int(n)
    return total


best_result = [9, 14, 15, 19, 23, 24, 32, 36, 40, 41, 42, 44, 45, 46, 50, 51, 54, 55, 56, 59, 63, 64, 65 , 69, 79]
normal_result = [10, 13, 16, 18, 20, 22, 25, 26, 28, 31, 35, 38, 39, 47, 49, 52, 53, 57, 58, 60, 61 ,62, 66, 68, 74, 75]
bad_result = [11, 12, 17, 21, 27, 29, 30, 33, 34, 37, 43, 48, 67, 70, 71, 72, 73, 76, 77, 78, 80]





#input
while True:
    print('------------------------')
    phone_number = input('กรุณากรอกเบอร์โทรศัพท์ : ')
    if berdee(phone_number) in best_result :
        summation = 'เลขมงคล'
        mean = 'โอกาสประสบผลสำเร็จสูง อุปสรรคน้อย เจริญรุ่งเรือง ร่ำรวย รวดเร็ว และมีความสุข'
    elif berdee(phone_number) in normal_result:
        summation = 'เลขปกติ'
        mean = 'เหนื่อย มีอุปสรรค แต่ยังมีโอกาสประสบผลสำเร็จ หากมีความพยายาม'
    elif berdee(phone_number) in bad_result:
        summation = 'เลขอัปมงคล'
        mean = 'เหนื่อยมาก อุปสรรคมาก เจอปัญหารุมเร้า การงาน การเงิน ความรัก เกิดอุบัติเหตุชีวิตไม่จบไม่สิ้น'
    elif phone_number == 'exit':
        break
    else:
        break
    Textoutput = f'ผลลัพธ์ : {summation} \nความหมาย : {mean} '
    print(Textoutput)